backend/app/Models/UserModel.php

    public function userListingCount(string $searchText = ''): int
    {
        $builder = $this->db->table('tbl_users as BaseTbl')
            ->select('BaseTbl.userId')
            ->join('tbl_roles as Role', 'Role.roleId = BaseTbl.roleId', 'left')
            ->where('BaseTbl.isDeleted', 0)
            ->where('BaseTbl.roleId !=', 1);
        if (!empty($searchText)) {
            $builder->groupStart()
                ->like('BaseTbl.email',  $searchText)
                ->orLike('BaseTbl.name', $searchText)
                ->orLike('BaseTbl.mobile', $searchText)
                ->groupEnd();
        }
        return $builder->get()->getNumRows();
---
SELECT `BaseTbl`.`userId`
FROM `tbl_users` as `BaseTbl`
LEFT JOIN `tbl_roles` as `Role` ON `Role`.`roleId` = `BaseTbl`.`roleId`
WHERE `BaseTbl`.`isDeleted` = 0
AND `BaseTbl`.`roleId` != 1

    public function userListing(string $searchText, int $limit, int $offset)
    {
        $builder = $this->db->table('tbl_users as BaseTbl')
            ->select('BaseTbl.userId, BaseTbl.email, BaseTbl.name, BaseTbl.mobile, BaseTbl.phonecode, BaseTbl.createdDtm, Role.role')
            ->join('tbl_roles as Role', 'Role.roleId = BaseTbl.roleId', 'left')
            ->where('BaseTbl.isDeleted', 0)
            ->where('BaseTbl.roleId !=', 1)
            ->orderBy('BaseTbl.userId', 'DESC')
            ->limit($limit, $offset);
        if (!empty($searchText)) {
            $builder->groupStart()
                ->like('BaseTbl.email',   $searchText)
                ->orLike('BaseTbl.name',  $searchText)
                ->orLike('BaseTbl.mobile', $searchText)
                ->groupEnd();
        }
        return $builder->get()->getResult();
---
SELECT `BaseTbl`.`userId`, `BaseTbl`.`email`, `BaseTbl`.`name`, `BaseTbl`.`mobile`, `BaseTbl`.`phonecode`, `BaseTbl`.`createdDtm`, `Role`.`role`
FROM `tbl_users` as `BaseTbl`
LEFT JOIN `tbl_roles` as `Role` ON `Role`.`roleId` = `BaseTbl`.`roleId`
WHERE `BaseTbl`.`isDeleted` = 0
AND `BaseTbl`.`roleId` != 1
ORDER BY `BaseTbl`.`userId` DESC
 LIMIT 10

    public function getUserInfoWithRole(int $userId)
    {
        return $this->db->table('tbl_users as u')
            ->select('u.userId, u.name, u.email, u.mobile, u.roleId, u.bank, u.paypal, u.phonecode, r.role')
            ->join('tbl_roles as r', 'r.roleId = u.roleId', 'left')
            ->where('u.userId', $userId)
            ->get()->getRow();
---
SELECT `u`.`userId`, `u`.`name`, `u`.`email`, `u`.`mobile`, `u`.`roleId`, `u`.`bank`, `u`.`paypal`, `u`.`phonecode`, `r`.`role`
FROM `tbl_users` as `u`
LEFT JOIN `tbl_roles` as `r` ON `r`.`roleId` = `u`.`roleId`
WHERE `u`.`userId` = 1

    public function getUserInfoById(int $userId)
    {
        return $this->db->table('tbl_users')
            ->select('userId, name, email, mobile, roleId')
            ->where('isDeleted', 0)
            ->where('userId',    $userId)
            ->get()->getRow();
---
SELECT `userId`, `name`, `email`, `mobile`, `roleId`
FROM `tbl_users`
WHERE `isDeleted` = 0
AND `userId` = 1

    public function loginHistoryCount(int $userId, string $searchText, string $fromDate, string $toDate): int
    {
        $builder = $this->db->table('tbl_last_login as BaseTbl')
            ->select('BaseTbl.userId');
        $this->_applyLoginHistoryWhere($builder, $userId, $searchText, $fromDate, $toDate);
        return $builder->get()->getNumRows();
---
SELECT `BaseTbl`.`userId`
FROM `tbl_last_login` as `BaseTbl`
WHERE `BaseTbl`.`userId` = 89

    public function loginHistory(int $userId, string $searchText, string $fromDate, string $toDate, int $limit, int $offset)
    {
        $builder = $this->db->table('tbl_last_login as BaseTbl')
            ->select('BaseTbl.userId, BaseTbl.sessionData, BaseTbl.machineIp, BaseTbl.userAgent, BaseTbl.agentString, BaseTbl.platform, BaseTbl.createdDtm')
            ->orderBy('BaseTbl.id', 'DESC')
            ->limit($limit, $offset);
        $this->_applyLoginHistoryWhere($builder, $userId, $searchText, $fromDate, $toDate);
        return $builder->get()->getResult();
---
SELECT `BaseTbl`.`userId`, `BaseTbl`.`sessionData`, `BaseTbl`.`machineIp`, `BaseTbl`.`userAgent`, `BaseTbl`.`agentString`, `BaseTbl`.`platform`, `BaseTbl`.`createdDtm`
FROM `tbl_last_login` as `BaseTbl`
WHERE `BaseTbl`.`userId` = 89
ORDER BY `BaseTbl`.`id` DESC
 LIMIT 10

    public function count_record(string $table): int
    {
        return $this->db->table($table)->get()->getNumRows();
---
SELECT *
FROM `tbl_users`