backend/app/Models/WebModel.php

SELECT `tbl_webs`.*
FROM `tbl_webs`
---
    public function get_allweb(string $searchText = '', string $limit = '')
    {
        $builder = $this->db->table('tbl_webs')->select('tbl_webs.*');
        if (!empty($searchText)) {
            $builder->like('tbl_webs.name', $searchText);
        }
        if (!empty($limit)) {
            $builder->limit((int)$limit);
        }
        return $builder->get()->getResult();

SELECT `tbl_webs`.*, `tbl_ranges`.`result_date`, `tbl_ranges`.`price`, `tbl_ranges`.`heading`, `tbl_ranges`.`logo`, `tbl_ranges`.`logo2`, `tbl_ranges`.`jackpot`, (SELECT date FROM `tbl_dates` WHERE web_id=tbl_webs.id AND date_con > "2026-03-26 " ORDER BY date ASC LIMIT 1) as date
FROM `tbl_webs`
JOIN `tbl_ranges` ON `tbl_ranges`.`web_id` = `tbl_webs`.`id`
WHERE `status` = 'Active'
ORDER BY `tbl_ranges`.`priority`
---
    public function home_web(string $limit = '')
    {
        $sub = '(SELECT date FROM `tbl_dates` WHERE web_id=tbl_webs.id AND date_con > "' . date('Y-m-d ') . '" ORDER BY date ASC LIMIT 1)';
        $builder = $this->db->table('tbl_webs')
            ->select("tbl_webs.*, tbl_ranges.result_date, tbl_ranges.price, tbl_ranges.heading, tbl_ranges.logo, tbl_ranges.logo2, tbl_ranges.jackpot, $sub as date")
            ->join('tbl_ranges', 'tbl_ranges.web_id = tbl_webs.id')
            ->where('status', 'Active')
            ->orderBy('tbl_ranges.priority');
        if (!empty($limit)) {
            $builder->limit((int)$limit);
        }
        return $builder->get()->getResult();

SELECT *
FROM `tbl_webs`
WHERE `id` = 11
---
    public function getWebInfo(int $id)
    {
        return $this->db->table('tbl_webs')->where('id', $id)->get()->getRow();

SELECT *
FROM `common`
---
    public function getcommon()
    {
        return $this->db->table('common')->get()->getRow();

SELECT *
FROM `tbl_ranges`
WHERE `web_id` = 11
---
    public function getrangeInfo(int $id)
    {
        return $this->db->table('tbl_ranges')->where('web_id', $id)->get()->getRow();

SELECT *
FROM `tbl_pages`
---
    public function page_list()
    {
        return $this->db->table('tbl_pages')->get()->getResult();

SELECT *
FROM `tbl_faqs`
ORDER BY `id` DESC
 LIMIT 1
---
    public function faq(int $limit = 0)
    {
        $builder = $this->db->table('tbl_faqs')->orderBy('id', 'DESC');
        if ($limit > 0) {
            $builder->limit($limit);
        }
        return $builder->get()->getResult();

SELECT `tbl_cart`.*, `tbl_webs`.`name`
FROM `tbl_cart`
JOIN `tbl_webs` ON `tbl_webs`.`id` = `tbl_cart`.`web_id`
WHERE `user_id` = 1
AND `paid_status` = 0
---
    public function cart_data(int $userId)
    {
        return $this->db->table('tbl_cart')
            ->select('tbl_cart.*, tbl_webs.name')
            ->join('tbl_webs', 'tbl_webs.id = tbl_cart.web_id')
            ->where('user_id', $userId)
            ->where('paid_status', 0)
            ->get()->getResult();

SELECT *
FROM `tbl_cart`
WHERE `web_id` = 11
AND `ticket_no` = 250381
AND `paid_status` = 1
ORDER BY `id`
---
    public function get_ticket_availability(int $ticket, int $web_id)
    {
        return $this->db->table('tbl_cart')
            ->where('web_id',     $web_id)
            ->where('ticket_no',  $ticket)
            ->where('paid_status', 1)
            ->orderBy('id')
            ->get()->getResult();

SELECT *
FROM `tbl_webs`
WHERE `id` = 11
---
    public function getallWebInfo(string $table, int $id)
    {
        return $this->db->table($table)->where('id', $id)->get()->getRow();

SELECT `tbl_order`.*
FROM `tbl_order`
LEFT JOIN `tbl_users` ON `tbl_users`.`userId` = `tbl_order`.`user_id`
ORDER BY `tbl_order`.`id` DESC
 LIMIT 10
---
    public function order_list(string $searchText, int $limit, int $offset)
    {
        return $this->_orderListBuilder($searchText)
            ->select('tbl_order.*')
            ->orderBy('tbl_order.id', 'DESC')
            ->limit($limit, $offset)
            ->get()->getResult();

SELECT *
FROM `tbl_contact`
---
    public function count_contact(): int
    {
        return $this->db->table('tbl_contact')->get()->getNumRows();

SELECT *
FROM `tbl_contact`
ORDER BY `id` DESC
 LIMIT 10
---
    public function contact_ls(int $limit, int $offset)
    {
        return $this->db->table('tbl_contact')
            ->orderBy('id', 'DESC')
            ->limit($limit, $offset)
            ->get()->getResult();

SELECT `tbl_order`.*, `tbl_webs`.`name`
FROM `tbl_order`
LEFT JOIN `tbl_webs` ON `tbl_webs`.`id` = CAST(JSON_UNQUOTE(JSON_EXTRACT(tbl_order.tickets, "$[0].web_id")) AS UNSIGNED)
WHERE `paid_status` = 'PAID'
ORDER BY `tbl_order`.`id` DESC
 LIMIT 5
---
    public function result_list(?int $webId = null, ?string $date = null, int $limit = 0)
    {
        $builder = $this->db->table('tbl_order')
            ->select('tbl_order.*, tbl_webs.name')
            ->join('tbl_webs', 'tbl_webs.id = CAST(JSON_UNQUOTE(JSON_EXTRACT(tbl_order.tickets, "$[0].web_id")) AS UNSIGNED)', 'left')
            ->where('paid_status', 'PAID')
            ->orderBy('tbl_order.id', 'desc');
        if (!empty($webId)) {
            $builder->where('CAST(JSON_UNQUOTE(JSON_EXTRACT(tbl_order.tickets, "$[0].web_id")) AS UNSIGNED)', $webId);
        }
        if (!empty($date)) {
            $builder->where('DATE(tbl_order.createdAt)', $date);
        }
        if ($limit > 0) {
            $builder->limit($limit);
        }
        return $builder->get()->getResult();

SELECT *
FROM `tbl_order`
WHERE `paid_status` = 'PAID'
---
    public function total_tickets_sold(): int
    {
        return $this->db->table('tbl_order')
            ->where('paid_status', 'PAID')
            ->get()->getNumRows();

SELECT SUM(`total_price`) AS `total`
FROM `tbl_order`
WHERE `paid_status` = 'PAID'
---
    public function total_revenue(): float
    {
        $row = $this->db->table('tbl_order')
            ->selectSum('total_price', 'total')
            ->where('paid_status', 'PAID')
            ->get()->getRow();

SELECT SUM(`total_price`) AS `total`
FROM `tbl_order`
WHERE `paid_status` = 'PAID'
AND DATE(createdAt) = '2026-03-26'
---
    public function today_revenue(): float
    {
        $row = $this->db->table('tbl_order')
            ->selectSum('total_price', 'total')
            ->where('paid_status', 'PAID')
            ->where('DATE(createdAt)', date('Y-m-d'))
            ->get()->getRow();

SELECT *
FROM `tbl_order`
WHERE `paid_status` = 'PAID'
AND DATE(createdAt) = '2026-03-26'
---
    public function today_orders(): int
    {
        return $this->db->table('tbl_order')
            ->where('paid_status', 'PAID')
            ->where('DATE(createdAt)', date('Y-m-d'))
            ->get()->getNumRows();

SELECT `tbl_order`.`id`, `tbl_order`.`total_price`, `tbl_order`.`paid_status`, `tbl_order`.`transaction_id`, `tbl_order`.`createdAt`, `tbl_order`.`tickets`, `tbl_users`.`name` AS `user_name`, `tbl_users`.`email` AS `user_email`
FROM `tbl_order`
LEFT JOIN `tbl_users` ON `tbl_users`.`userId` = `tbl_order`.`user_id`
WHERE `tbl_order`.`paid_status` = 'PAID'
ORDER BY `tbl_order`.`id` DESC
 LIMIT 8
---
    public function recent_transactions(int $limit = 8)
    {
        return $this->db->table('tbl_order')
            ->select('tbl_order.id, tbl_order.total_price, tbl_order.paid_status, tbl_order.transaction_id, tbl_order.createdAt, tbl_order.tickets, tbl_users.name AS user_name, tbl_users.email AS user_email')
            ->join('tbl_users', 'tbl_users.userId = tbl_order.user_id', 'left')
            ->where('tbl_order.paid_status', 'PAID')
            ->orderBy('tbl_order.id', 'DESC')
            ->limit($limit)
            ->get()->getResult();

SELECT `tbl_webs`.`id`, `tbl_webs`.`name`, `tbl_ranges`.`price`, `tbl_ranges`.`jackpot`, `tbl_ranges`.`result_date`
FROM `tbl_webs`
LEFT JOIN `tbl_ranges` ON `tbl_ranges`.`web_id` = `tbl_webs`.`id`
WHERE `tbl_webs`.`status` = 'Active'
AND `tbl_ranges`.`result_date` >= '2026-03-26'
ORDER BY `tbl_ranges`.`result_date` ASC
 LIMIT 5
---
    public function upcoming_events(int $limit = 5)
    {
        return $this->db->table('tbl_webs')
            ->select('tbl_webs.id, tbl_webs.name, tbl_ranges.price, tbl_ranges.jackpot, tbl_ranges.result_date')
            ->join('tbl_ranges', 'tbl_ranges.web_id = tbl_webs.id', 'left')
            ->where('tbl_webs.status', 'Active')
            ->where('tbl_ranges.result_date >=', date('Y-m-d'))
            ->orderBy('tbl_ranges.result_date', 'ASC')
            ->limit($limit)
            ->get()->getResult();

SELECT `tbl_order`.*, `tbl_users`.`name` as `uname`, `tbl_webs`.`name` as `game_name`, `tbl_order`.`id`
FROM `tbl_order`
LEFT JOIN `tbl_users` ON `tbl_users`.`userId` = `tbl_order`.`user_id`
LEFT JOIN `tbl_webs` ON `tbl_webs`.`id` = `tbl_order`.`web_id`
WHERE `tbl_order`.`prize` != ''
AND tbl_order.prize IS NOT NULL
---
    private function _winnerListBuilder(string $search)
    {
        $builder = $this->db->table('tbl_order')
            ->select('tbl_order.*, tbl_users.name as uname, tbl_webs.name as game_name')
            ->join('tbl_users', 'tbl_users.userId = tbl_order.user_id', 'left')
            ->join('tbl_webs', 'tbl_webs.id = tbl_order.web_id', 'left')
            ->where('tbl_order.prize !=', '')
            ->where('tbl_order.prize IS NOT NULL', null, false);

SELECT SUM(`prize`) AS `sum`
FROM `tbl_order`
WHERE `prize` != ''
AND prize IS NOT NULL
---
    public function admin_winner_total(): object
    {
        $row = $this->db->table('tbl_order')
            ->selectSum('prize', 'sum')
            ->where('prize !=', '')
            ->where('prize IS NOT NULL', null, false)
            ->get()->getRow();

SELECT `tbl_refund`.*, `tbl_users`.`name` as `uname`, `tbl_refund`.`id`
FROM `tbl_refund`
LEFT JOIN `tbl_users` ON `tbl_users`.`userId` = `tbl_refund`.`user_id`
---
    private function _refundListBuilder(string $search)
    {
        $builder = $this->db->table('tbl_refund')
            ->join('tbl_users', 'tbl_users.userId = tbl_refund.user_id', 'left')
            ->select('tbl_refund.*, tbl_users.name as uname');