app/Models/LoginModel.php

SELECT `BaseTbl`.`userId`, `BaseTbl`.`email`, `BaseTbl`.`mobile`, `BaseTbl`.`password`, `BaseTbl`.`name`, `BaseTbl`.`roleId`, `Roles`.`role`
FROM `tbl_users` as `BaseTbl`
JOIN `tbl_roles` as `Roles` ON `Roles`.`roleId` = `BaseTbl`.`roleId`
WHERE   (
`BaseTbl`.`email` = 'admin@theitanagarchoice.com'
OR `BaseTbl`.`mobile` = 'admin@theitanagarchoice.com'
 )
AND `BaseTbl`.`isDeleted` = 0
---
    public function loginMe(string $email, string $password)
    {
        $result = $this->db->table('tbl_users as BaseTbl')
            ->select('BaseTbl.userId, BaseTbl.email, BaseTbl.mobile, BaseTbl.password, BaseTbl.name, BaseTbl.roleId, Roles.role')
            ->join('tbl_roles as Roles', 'Roles.roleId = BaseTbl.roleId')
            ->groupStart()
            ->where('BaseTbl.email', $email)
            ->orWhere('BaseTbl.mobile', $email)
            ->groupEnd()
            ->where('BaseTbl.isDeleted', 0)
            ->get()->getRow();

INSERT INTO `tbl_last_login` (`userId`, `sessionData`, `machineIp`, `userAgent`, `agentString`, `platform`) VALUES ('1', '{\"name\":\"System Administrator\",\"email\":\"admin@theitanagarchoice.com\"}', '::1', 'Unidentified User Agent', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'Windows 10')
---
    public function lastLogin(array $loginInfo): void
    {
        $this->db->transStart();
        $this->db->table('tbl_last_login')->insert($loginInfo);